adurantek/embedded-hardware-sandbox/Embedded_System/STM32-Bare-Metal-Exercises/I2C/I2C_PROJECT/Core/Src/main.c
#include <stdint.h>
#include <stdio.h>
#include <sys/_intsup.h>
#include "stm32c031xx.h"
#include "stm32c0xx.h"

uint8_t lsb, msb, read_value, flagread = 0;
uint16_t value = 0;
volatile uint8_t trigger = 0;

void IntToHexStr(uint16_t num, char* str) {

    const char hex_digits[] = "0123456789ABCDEF"; 
    
    str[0] = '0';
    str[1] = 'x';

    str[2] = hex_digits[(num >> 12) & 0x0F]; 

    str[3] = hex_digits[(num >> 8) & 0x0F];  

    str[4] = hex_digits[(num >> 4) & 0x0F];  

    str[5] = hex_digits[num & 0x0F];         
    
    str[6] = '\0';
}

void IntToStr(uint16_t num, char* str) {
    uint8_t i = 0;
    char temp[6];
    
    if (num == 0) {
        str[0] = '0';
        str[1] = '\0';
        return;
    }
    
    while (num > 0) {
        temp[i] = (num % 10) + '0';
        num = num / 10;
        i++;
    }

    uint8_t j = 0;
    while (i > 0) {
        i--;
        str[j] = temp[i];
        j++;
    }
    str[j] = '\0';
}

const uint8_t Font5x7[] = {
	0x00, 0x00, 0x00, 0x00, 0x00,// (space)
	0x00, 0x00, 0x5F, 0x00, 0x00,// !
	0x00, 0x07, 0x00, 0x07, 0x00,// "
	0x14, 0x7F, 0x14, 0x7F, 0x14,// #
	0x24, 0x2A, 0x7F, 0x2A, 0x12,// $
	0x23, 0x13, 0x08, 0x64, 0x62,// %
	0x36, 0x49, 0x55, 0x22, 0x50,// &
	0x00, 0x05, 0x03, 0x00, 0x00,// '
	0x00, 0x1C, 0x22, 0x41, 0x00,// (
	0x00, 0x41, 0x22, 0x1C, 0x00,// )
	0x08, 0x2A, 0x1C, 0x2A, 0x08,// *
	0x08, 0x08, 0x3E, 0x08, 0x08,// +
	0x00, 0x50, 0x30, 0x00, 0x00,// ,
	0x08, 0x08, 0x08, 0x08, 0x08,// -
	0x00, 0x60, 0x60, 0x00, 0x00,// .
	0x20, 0x10, 0x08, 0x04, 0x02,// /
	0x3E, 0x51, 0x49, 0x45, 0x3E,// 0
	0x00, 0x42, 0x7F, 0x40, 0x00,// 1
	0x42, 0x61, 0x51, 0x49, 0x46,// 2
	0x21, 0x41, 0x45, 0x4B, 0x31,// 3
	0x18, 0x14, 0x12, 0x7F, 0x10,// 4
	0x27, 0x45, 0x45, 0x45, 0x39,// 5
	0x3C, 0x4A, 0x49, 0x49, 0x30,// 6
	0x01, 0x71, 0x09, 0x05, 0x03,// 7
	0x36, 0x49, 0x49, 0x49, 0x36,// 8
	0x06, 0x49, 0x49, 0x29, 0x1E,// 9
	0x00, 0x36, 0x36, 0x00, 0x00,// :
	0x00, 0x56, 0x36, 0x00, 0x00,// ;
	0x00, 0x08, 0x14, 0x22, 0x41,// <
	0x14, 0x14, 0x14, 0x14, 0x14,// =
	0x41, 0x22, 0x14, 0x08, 0x00,// >
	0x02, 0x01, 0x51, 0x09, 0x06,// ?
	0x32, 0x49, 0x79, 0x41, 0x3E,// @
	0x7E, 0x11, 0x11, 0x11, 0x7E,// A
	0x7F, 0x49, 0x49, 0x49, 0x36,// B
	0x3E, 0x41, 0x41, 0x41, 0x22,// C
	0x7F, 0x41, 0x41, 0x22, 0x1C,// D
	0x7F, 0x49, 0x49, 0x49, 0x41,// E
	0x7F, 0x09, 0x09, 0x01, 0x01,// F
	0x3E, 0x41, 0x41, 0x51, 0x32,// G
	0x7F, 0x08, 0x08, 0x08, 0x7F,// H
	0x00, 0x41, 0x7F, 0x41, 0x00,// I
	0x20, 0x40, 0x41, 0x3F, 0x01,// J
	0x7F, 0x08, 0x14, 0x22, 0x41,// K
	0x7F, 0x40, 0x40, 0x40, 0x40,// L
	0x7F, 0x02, 0x04, 0x02, 0x7F,// M
	0x7F, 0x04, 0x08, 0x10, 0x7F,// N
	0x3E, 0x41, 0x41, 0x41, 0x3E,// O
	0x7F, 0x09, 0x09, 0x09, 0x06,// P
	0x3E, 0x41, 0x51, 0x21, 0x5E,// Q
	0x7F, 0x09, 0x19, 0x29, 0x46,// R
	0x46, 0x49, 0x49, 0x49, 0x31,// S
	0x01, 0x01, 0x7F, 0x01, 0x01,// T
	0x3F, 0x40, 0x40, 0x40, 0x3F,// U
	0x1F, 0x20, 0x40, 0x20, 0x1F,// V
	0x7F, 0x20, 0x18, 0x20, 0x7F,// W
	0x63, 0x14, 0x08, 0x14, 0x63,// X
	0x03, 0x04, 0x78, 0x04, 0x03,// Y
	0x61, 0x51, 0x49, 0x45, 0x43,// Z
	0x00, 0x00, 0x7F, 0x41, 0x41,// [
	0x02, 0x04, 0x08, 0x10, 0x20,// "\"
	0x41, 0x41, 0x7F, 0x00, 0x00,// ]
	0x04, 0x02, 0x01, 0x02, 0x04,// ^
	0x40, 0x40, 0x40, 0x40, 0x40,// _
	0x00, 0x01, 0x02, 0x04, 0x00,// `
	0x20, 0x54, 0x54, 0x54, 0x78,// a
	0x7F, 0x48, 0x44, 0x44, 0x38,// b
	0x38, 0x44, 0x44, 0x44, 0x20,// c
	0x38, 0x44, 0x44, 0x48, 0x7F,// d
	0x38, 0x54, 0x54, 0x54, 0x18,// e
	0x08, 0x7E, 0x09, 0x01, 0x02,// f
	0x08, 0x14, 0x54, 0x54, 0x3C,// g
	0x7F, 0x08, 0x04, 0x04, 0x78,// h
	0x00, 0x44, 0x7D, 0x40, 0x00,// i
	0x20, 0x40, 0x44, 0x3D, 0x00,// j
	0x00, 0x7F, 0x10, 0x28, 0x44,// k
	0x00, 0x41, 0x7F, 0x40, 0x00,// l
	0x7C, 0x04, 0x18, 0x04, 0x78,// m
	0x7C, 0x08, 0x04, 0x04, 0x78,// n
	0x38, 0x44, 0x44, 0x44, 0x38,// o
	0x7C, 0x14, 0x14, 0x14, 0x08,// p
	0x08, 0x14, 0x14, 0x18, 0x7C,// q
	0x7C, 0x08, 0x04, 0x04, 0x08,// r
	0x48, 0x54, 0x54, 0x54, 0x20,// s
	0x04, 0x3F, 0x44, 0x40, 0x20,// t
	0x3C, 0x40, 0x40, 0x20, 0x7C,// u
	0x1C, 0x20, 0x40, 0x20, 0x1C,// v
	0x3C, 0x40, 0x30, 0x40, 0x3C,// w
	0x44, 0x28, 0x10, 0x28, 0x44,// x
	0x0C, 0x50, 0x50, 0x50, 0x3C,// y
	0x44, 0x64, 0x54, 0x4C, 0x44,// z
	0x00, 0x08, 0x36, 0x41, 0x00,// {
	0x00, 0x00, 0x7F, 0x00, 0x00,// |
	0x00, 0x41, 0x36, 0x08, 0x00,// }
	0x08, 0x08, 0x2A, 0x1C, 0x08,// ->
	0x08, 0x1C, 0x2A, 0x08, 0x08 // <- **96th
};

void delay(volatile unsigned long ms) {
	for (volatile unsigned long i = 0; i < ms * 1000; i++) {
		__NOP();
	}
}

void setup (void) {
	RCC -> IOPENR |= (1 << 1);  									//PORT B ENABLE
	RCC -> APBENR1 |= (1 << 21);									//I2C1 PERHIPRAL ENABLE						//I2C1 PERHIPRAL RESET RELEASE (BECAUSE OLED SCREEN IS NOT WORKING WITHOUT RESET RELEASE)
	RCC -> APBRSTR1 |= (1 << 21);									//I2C1 PERHIPRAL RESET
	RCC -> APBRSTR1 &= ~(1 << 21);									//I2C1 PERHIPRAL RESET RELEASE
	RCC -> APBENR1 |= (1 << 1);	 									//TIMER3 PERHIPRAL ENABLE
	
	GPIOB->MODER &= ~((3 << 16) | (3 << 18)); // MODER (00) (PB8 AND PB9)
	GPIOB->MODER |= ((1 << 16) | (1 << 18));  // MODER (01) (PB8 AND PB9) (OUTPUT MODE)

	GPIOB -> PUPDR &= ~((3 << 16) | (3 << 18)); // PULL-UP/DOWN (00)
	GPIOB -> PUPDR |= ((1 << 16) | (1 << 18));  // PULL-UP ENABLE (01)
	
	for(int i=0; i<9; i++) {
        GPIOB -> BSRR = (1 << 24); // SCL LOW (PB8 Reset)
        delay(1);
        GPIOB -> BSRR = (1 << 8);  // SCL HIGH (PB8 Set)
        delay(1);
    }


    // I2C PİNLERİNİ GERÇEKTEN ALTERNATE FUNCTION (10) YAPMAK
    GPIOB -> MODER &= ~((3 << 16) | (3 << 18)); // Önce tamamen sıfırla (00)
    GPIOB -> MODER |= ((2 << 16) | (2 << 18));  // Sonra 10 (Binary 2) yazarak AF yap!
    
    GPIOB -> OTYPER |= ((1 << 8) | (1 << 9));   // OPEN-DRAIN ENABLE
    GPIOB -> AFR[1] |= ((1 << 1) | (1 << 2) | (1 << 5) | (1 << 6)); // SCL AND SDA ENABLE

	//100Khz for 16Mhz Table 114.

	I2C1 -> TIMINGR |= ((0x3 << 28)   //PRESC
					|  (0x13 << 0)    //SCLL
					|  (0xF << 8)     //SCLH
					|  (0x2 << 16)    //SDADEL
					|  (0x4 << 20));  //SCLDEL

	I2C1 -> CR1 |= (1 << 0);	 	  //PERHIPRAL ENABLE


	//TIMER CONFIGURATION FOR 1HZ INTERRUPT
	TIM3 -> CNT = 0; 				  //COUNTER RESET
	TIM3 -> PSC = 16000 - 1; 		  //PRESCALER (16MHZ / 16000 = 1KHZ)
	TIM3 -> ARR = 4 - 1; 		 	  //AUTO RELOAD REGISTER (1KHZ / 4.5 = 222.22HZ)

	//TIMER INTERRUPT CONFIGURATION
	TIM3 -> DIER |= (1 << 0); 		  //UPDATE INTERRUPT
	NVIC_EnableIRQ(TIM3_IRQn);   //NVIC ENABLE

	delay(1000); 					  //WAIT 1 SECOND FOR STABILIZATION
}

void TIM3_IRQHandler(void) {
	if (TIM3 -> SR & (1 << 0)) {  //UPDATE INTERRUPT FLAG CONTROL
		trigger = 1;
		TIM3 -> SR &= ~(1 << 0);  //UPDATE INTERRUPT FLAG RESET
	}
}

void I2C_Write_Byte(uint8_t *data_array, uint8_t adres, uint8_t size) {
	I2C1 -> CR2	=     ((adres << 1)  //SADD (SENSOR ADDRESS)
				    |  (size << 16)  //NBYTE (size byte)
					|  (1 << 13));   //START
	// NOTE: READ/WRİTE 0 DEFAULT

	for (uint8_t i=0; i < size; i++) {
	while((I2C1 -> ISR & (1 << 1)) == 0) /* TXIS FLAG CONTROL */ { 
		if (I2C1 -> ISR & (1 << 4)) { //NACK FLAG CONTROL
			I2C1 -> ICR |= (1 << 4); //NACK FLAG RESET
			I2C1 -> CR2 |= (1 << 14); //STOP
			return; //IF NACK FLAG IS SET, STOP AND RETURN
		}
	}
	
	I2C1 -> TXDR = data_array[i];
	}
	while((I2C1 -> ISR & (1 << 6)) == 0) /* COMPLETE FLAG CONTROL */ { }
	I2C1 -> CR2 |= (1 << 14); //STOP

	while((I2C1 -> ISR & (1 << 5)) == 0) { } //STOP FLAG CONTROL
	I2C1 -> ICR |= (1 << 5); //STOP FLAG RESET
}

void OLED_Open() {
	//OLED SCREEN ADRESSES
	uint8_t oled_init_cmd[26] = {
		0x00,       // CONTROL BYTE
	    0xAE,       // (Display OFF)
	    0xD5, 0x80, // CLOCK FREQUENCY CONFIG
		0xA8, 0x1F, // MULTIPLEX CONFIG (32 SATIR ICIN)
	    0xD3, 0x00, // SCREEN MOVEMENT RESET
	    0x40,       // STARTING LINE CONFIG
	    0x8D, 0x14, // CHARGE PUMP ENABLE
	    0x20, 0x00, // MEMORY ADDRESS MODE CONFIG
	    0xA1,       // COLUMN ADDRESSES INVERTED (SO THE DISPLAY IS NOT MIRRORED)
	    0xC8,       // COM OUTPUT SCAN DIRECTION INVERTED
		0xDA, 0x02, // HARDWARE PIN CONFIGURATION
	    0x81, 0xCF, // CONTRAST CONFIG
	    0xD9, 0xF1, // PRE-CHARGE PERIOD
	    0xDB, 0x40, // VCOMH VOLTAGE LEVEL
	    0xA4,       // ALL PIXELS CONNECT TO RAM
	    0xA6,       // NORMAL DISPLAY (0xA7 = INVERTED DISPLAY)
	    0xAF        // ENABLE DISPLAY
	};
	I2C_Write_Byte(oled_init_cmd, 0x3C, 26);
}

void Set_Cursor(uint8_t column, uint8_t page) {
	uint8_t list[7] = {
		0x00, 										//CONTROL (D/C# = 0) (DATASHEET)
		0x21, column, 127,  						//CONFIGURE HORIZONTAL (SSD1306 DATASHEET PAGE 30)
		0x22, page, 3 								//CONFIGURE VERTICAL (SSD1306 DATASHEET PAGE 31)
	};

	I2C_Write_Byte(list,0x3C,7);
}

void clear_pixels() {
	uint8_t clear_list[129];  											// 1 CONTROL BYTE + 128 PIXELS
	clear_list[0] = 0x40;     											//CONTROL BYTE (D/C# = 1) (DATASHEET)

	for (uint8_t i=1;i<129;i++) {
		clear_list[i] = 0x00; 											//PIXEL DATA (0x00 = BLACK, 0xFF = WHITE)
	}

	for (uint8_t j=0;j<8;j++) {
		I2C_Write_Byte(clear_list,0x3C,129);
	}
}

uint8_t BMP180_Read_Byte(void) {
	I2C1 -> CR2 =	 ((0x77 << 1)  //SADD (BMP180 ADDRESS)
				    |  (1 << 16)   //NBYTE (1 byte)
					|  (1 << 13)); //START

	while((I2C1 -> ISR & (1 << 1)) == 0) /* TXIS FLAG CONTROL */ { } //WHAT IS DOING IF TXIS FLAG IS NOT SET? JUST WAITING UNTIL TXIS FLAG IS SET
	I2C1 -> TXDR = 0xD0;

	while((I2C1 -> ISR & (1 << 6)) == 0) /* COMPLETE FLAG CONTROL */ { }

	I2C1 -> CR2 = 	((0x77 << 1)  //SADD (BMP180 ADRESS)
					| (1 << 16)   //NBYTES (1 Byte)
					| (1 << 10)   //READ MODE
					| (1 << 13)); //START

	while((I2C1->ISR & (1 << 2)) == 0) /* RXNE FLAG CONTROL */ { }  //WHAT IS DOING IF RXNE FLAG IS NOT SET? JUST WAITING UNTIL RXNE FLAG IS SET
	read_value = I2C1->RXDR; //read_value must be 0x55 (BMP180 DATASHEET PAGE 18 FIGURE 6 CHIP ID)
	while((I2C1->ISR & (1 << 6)) == 0) /* COMPLETE FLAG CONTROL */ {}
	I2C1->CR2 |= (1 << 14); //STOP
	while((I2C1->ISR & (1 << 5)) == 0) { } //STOP FLAG CONTROL
	I2C1->ICR |= (1 << 5); //STOP FLAG RESET
	
	return read_value; 
}

void OLED_PutChar(uint8_t c) {
	if (c < 32 || c > 126) return; //IF CHARACTER IS OUT OF RANGE, RETURN
	
	uint16_t index = (c - 32)*5;
	uint8_t charr[7]; 													//1 CONTROL BYTE + 5 FONT BYTES + 1 SPACE BYTE
	charr[0] = 0x40;
	for (uint8_t i=1;i<6;i++) { charr[i] = Font5x7[index + (i - 1)]; }
	charr[6] = 0x00; 													//SPACE BETWEEN CHARACTERS
	I2C_Write_Byte(charr,0x3C,7);
}

void OLED_Print(char *str) {
	while (*str) {
		OLED_PutChar(*str);
		str++;
	}
}

uint8_t BMP180_FINISHFLAG(void) {
	I2C1->CR2 =	 ((0x77 << 1) //SADD (BMP180 ADDRESS)
				| (1 << 16)   //NBYTE (1 byte)
				| (1 << 13)); //START			
	while((I2C1->ISR & (1 << 1)) == 0) /* TXIS FLAG CONTROL */ { }
	I2C1->TXDR = 0xF4;
	while((I2C1->ISR & (1 << 6)) == 0) /* COMPLETE FLAG CONTROL */ { }
	I2C1->CR2 |= (1 << 14); 				//STOP
	while((I2C1->ISR & (1 << 5)) == 0) { }  //STOP FLAG CONTROL
	I2C1->ICR |= (1 << 5); 					//STOP FLAG RESET
	I2C1->CR2 =	 ((0x77 << 1) //SADD (BMP180 ADDRESS)
				| (1 << 16)   //NBYTE (1 byte)
				| (1 << 10)   //READ MODE
				| (1 << 13)); //START
	while((I2C1->ISR & (1 << 2)) == 0) /* RXNE FLAG CONTROL */ { }
	flagread = I2C1->RXDR;
	while((I2C1->ISR & (1 << 6)) == 0) /* COMPLETE FLAG CONTROL */ { }
	I2C1->CR2 |= (1 << 14); 				//STOP
	while((I2C1->ISR & (1 << 5)) == 0) { }  //STOP FLAG CONTROL
	I2C1->ICR |= (1 << 5); 					//STOP FLAG RESET
	
	return (flagread & (1 << 5));
}

void BMP180_Read_16Bit(void) {
	I2C1->CR2 =	 ((0x77 << 1) //SADD (BMP180 ADDRESS)
				| (2 << 16)   //NBYTE (2 byte)
				| (1 << 13)); //START
		while((I2C1->ISR & (1 << 1)) == 0) /* TXIS FLAG CONTROL */ {
			if (I2C1->ISR & (1 << 4)) { //NACK FLAG CONTROL
				I2C1->ICR |= (1 << 4); //NACK FLAG RESET
				I2C1->CR2 |= (1 << 14); //STOP
				while((I2C1->ISR & (1 << 5)) == 0) { } //STOPF
				I2C1->ICR |= (1 << 5); //STOP FLAG RESET
				return;
			}
		}
	I2C1->TXDR = 0xF4; 				  //WRITE REGISTER ADDRESS (BMP180 DATASHEET PAGE 21 TABLE 8)
	while((I2C1->ISR & (1 << 1)) == 0) /* TXIS FLAG CONTROL */ { } //WHAT IS DOING IF TXIS FLAG IS NOT SET? JUST WAITING UNTIL TXIS FLAG IS SET
	I2C1->TXDR = 0x2E; 				  //CONTROL REGISTER VALUE (BMP180 DATASHEET PAGE 21 TABLE 8)
	while((I2C1->ISR & (1 << 6)) == 0) /* COMPLETE FLAG CONTROL */ { }
	I2C1->CR2 |= (1 << 14);					//STOP
	while ((I2C1->ISR & (1 << 5)) == 0) { } //STOP FLAG CONTROL
	I2C1->ICR |= (1 << 5); 				  	//STOP FLAG RESET

	while(!BMP180_FINISHFLAG()) { } //WAIT UNTIL BMP180 FINISH FLAG IS SET
	
	//LSB AND MSB READ
	I2C1->CR2 =	 ((0x77 << 1) //SADD (BMP180 ADDRESS)
				| (1 << 16)   //NBYTE (1 byte)
				| (1 << 13)); //START
	while((I2C1->ISR & (1 << 1)) == 0) /* TXIS FLAG CONTROL */ { } //WHAT IS DOING IF TXIS FLAG IS NOT SET? JUST WAITING UNTIL TXIS FLAG IS SET
	I2C1->TXDR = 0xF6;
	while((I2C1->ISR & (1 << 6)) == 0) /* COMPLETE FLAG CONTROL */ { }
	I2C1->CR2 =	 ((0x77 << 1) //SADD (BMP180 ADDRESS)
				| (2 << 16)   //NBYTE (2 byte)
				| (1 << 10)   //READ MODE
				| (1 << 13)); //START
	while((I2C1->ISR & (1 << 2)) == 0) /* RXNE FLAG CONTROL */ { }  //WHAT IS DOING IF RXNE FLAG IS NOT SET? JUST WAITING UNTIL RXNE FLAG IS SET
	msb = I2C1->RXDR;
	while((I2C1->ISR & (1 << 2)) == 0) /* RXNE FLAG CONTROL */ { }  //WHAT IS DOING IF RXNE FLAG IS NOT SET? JUST WAITING UNTIL RXNE FLAG IS SET
	lsb = I2C1->RXDR;

	while((I2C1 -> ISR & (1 << 6)) == 0) { } //COMPLETE FLAG CONTROL
	I2C1->CR2 |= (1 << 14);                  //STOP
    while((I2C1 -> ISR & (1 << 5)) == 0) { } //STOP FLAG CONTROL
	I2C1->ICR |= (1 << 5);                   //STOP FLAG RESET

	value = (msb << 8) | lsb; //COMBINE MSB AND LSB
}

int main (void) {
	setup();
	delay(1000); 
	OLED_Open();
	clear_pixels();

	//char val_str[10] = {0};

	while (1) {
		//BMP180_Read_16Bit();
		//IntToHexStr(value, val_str);
		
		Set_Cursor(0,2);
		OLED_Print("Value: ");
		//OLED_Print(val_str); 
		OLED_Print("  ");    

		delay(200); 
	}
}
